artillery-load-test.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  processor: './dist/create-dummy-onlineboard.js'
  payload:
    - path: './artillery/onlineboard.csv'
      fields:
        - 'title'
        - 'content'
    - path: './artillery/onlineboardcomment.csv'
      fields:
        - 'content'
  defaults:
    headers:
      Cookie: 'authorization=Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOjEwMSwiaWF0IjoxNzEyODE5NjE0LCJleHAiOjE3NTYwMTk2MTR9.HRyDR3Xk5VNs2_sLCsxtY2oFeWe24u0iVrvdU2eInlU'
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
scenarios:
  - name: 'create online board'
    flow:
      - get:
          url: 'http://localhost:3000/online-boards'
      - get:
          url: 'http://localhost:3000/online-boards/1'
      - post:
          url: 'http://localhost:3000/online-boards'
          json:
            title: '{{$loopElement.title}}'
            content: '{{$loopElement.content}}'
  - name: 'create online board comment'
    flow:
      - get:
          url: 'http://localhost:3000/online-boards/1/comments'
      - post:
          url: 'http://localhost:3000/online-boards/1/comments'
          json:
            content: '{{ $loopElement.content }}'
# ./node_modules/.bin/artillery run ./asciiart-load-test.yaml
# ./node_modules/.bin/artillery run --output report.json ./asciiart-load-test.yaml