artillery-load-test.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  processor:
    - './artillery/generate-data.js'
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  plugin:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
scenarios:
  - name: 'online board flow'
    flow:
      - get:
          url: 'http://localhost:3000/online-boards'
      - get:
          url: 'http://localhost:3000/online-boards/1'
      - get:
          url: 'http://localhost:3000/online-boards/comments/1'
      - function: 'generateRandomData'
      - post:
          url: 'http://localhost:3000/online-boards/comments/1'
          json:
            content: '{{ content }}'
# ./node_modules/.bin/artillery run ./asciiart-load-test.yaml
# ./node_modules/.bin/artillery run --output report.json ./asciiart-load-test.yaml